{"format": "graph-model", "generatedBy": "1.15.5", "convertedBy": "TensorFlow.js Converter v4.9.0", "signature": {"inputs": {"obs": {"name": "policyNet/input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "412"}]}}}, "outputs": {"logits": {"name": "logits:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1695"}]}}}}, "modelTopology": {"node": [{"name": "policyNet/fc1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "412"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "policyNet/fc1/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "policyNet/fc2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "policyNet/fc2/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "policyNet/pi/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1695"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "policyNet/pi/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1695"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "policyNet/input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "412"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "policyNet/fc1/Relu", "op": "_FusedMatMul", "input": ["policyNet/input", "policyNet/fc1/w", "policyNet/fc1/b"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "policyNet/Relu", "op": "Relu", "input": ["policyNet/fc1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "policyNet/fc2/Relu", "op": "_FusedMatMul", "input": ["policyNet/Relu", "policyNet/fc2/w", "policyNet/fc2/b"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "policyNet/Relu_1", "op": "Relu", "input": ["policyNet/fc2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "policyNet/pi/Relu", "op": "_FusedMatMul", "input": ["policyNet/Relu_1", "policyNet/pi/w", "policyNet/pi/b"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "logits", "op": "Identity", "input": ["policyNet/pi/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "policyNet/fc1/w", "shape": [412, 512], "dtype": "float32"}, {"name": "policyNet/fc1/b", "shape": [512], "dtype": "float32"}, {"name": "policyNet/fc2/w", "shape": [512, 256], "dtype": "float32"}, {"name": "policyNet/fc2/b", "shape": [256], "dtype": "float32"}, {"name": "policyNet/pi/w", "shape": [256, 1695], "dtype": "float32"}, {"name": "policyNet/pi/b", "shape": [1695], "dtype": "float32"}]}]}